fr0sty1/ch32v003fun/examples/tim1_pwm/audio.c

/*
    Audio library
    by D. Scott Williamson 2023
*/

#include "ch32v003fun.h"
#include "audio.h"
#include <stdio.h>
#include <stdbool.h>

// Audio system instance
AL_System audio_system;

// noise sampler
int8_t audio_noise1_sampler(uint16_t index)
{

    static int8_t value;
    value = (SysTick->CNT) ^value;  // tinny white noise
    return value;
}

// noise 2 sampler
int8_t audio_noise2_sampler(uint16_t index)
{

    static int8_t value;
    value = (SysTick->CNT) ^value^index;  // midtone white noise, index changes pitch
    return value;
}

// robot sampler
int8_t audio_robot_sampler(uint16_t index)
{
   return SysTick->CNT^index;  // midtone robotfrequency changes pitch
}

// sawtooth sampler
int8_t audio_sawtooth_sampler(uint16_t index)
{
    return (int8_t) (index>>8);
}

// square wave sampler
int8_t audio_square_sampler(uint16_t index)
{
    return (int8_t) ((index& 0x8000)?-127:127);
}

// triangle sampler
int8_t audio_triangle_sampler(uint16_t index)
{
    if (index&0x8000)
    {
        return -((int8_t) (((index>>7)&0xff)))-129;
    }
    else
    {
        return (int8_t) (((index>>7)&0xff))+128;
    }
} 

// redo quarter sintab to be signed 0 center
const int8_t quartersintab[256]={
        0,0,1,2,3,3,4,5,6,7,7,8,9,10,10,11,
        12,13,14,14,15,16,17,18,18,19,20,21,21,22,23,24,
        24,25,26,27,28,28,29,30,31,31,32,33,34,34,35,36,
        37,37,38,39,40,40,41,42,43,43,44,45,46,46,47,48,
        48,49,50,51,51,52,53,54,54,55,56,56,57,58,58,59,
        60,61,61,62,63,63,64,65,65,66,67,67,68,69,69,70,
        71,71,72,73,73,74,74,75,76,76,77,78,78,79,79,80,
        81,81,82,83,83,84,84,85,85,86,87,87,88,88,89,89,
        90,91,91,92,92,93,93,94,94,95,95,96,96,97,97,98,
        98,99,99,100,100,101,101,102,102,103,103,104,104,105,105,105,
        106,106,107,107,108,108,108,109,109,110,110,110,111,111,112,112,
        112,113,113,113,114,114,115,115,115,116,116,116,117,117,117,117,
        118,118,118,119,119,119,119,120,120,120,121,121,121,121,122,122,
        122,122,122,123,123,123,123,123,124,124,124,124,124,125,125,125,
        125,125,125,125,126,126,126,126,126,126,126,126,127,127,127,127,
        127,127,127,127,127,127,127,127,127,127,127,127,127,127,127,127
};


// sine sampler
int8_t audio_sine_sampler(uint16_t index)
{
    uint16_t tableindex=(index>>6)& 0xff;
    switch (index&0xc000)
    {
        case 0x0000:
            return quartersintab[tableindex];
        case 0x4000:
            return quartersintab[255-tableindex];
        case 0x8000:
            return -(quartersintab[tableindex]);
        default:
        case 0xc000:
            return -(quartersintab[255-tableindex]);
    }
}

// 4 octave sine sampler
int8_t audio_4octave_sine_sampler(uint16_t index)
{
    int16_t sample =   audio_sine_sampler(index)
                     + audio_sine_sampler(index<<1)
                     + audio_sine_sampler(index<<2)
                     + audio_sine_sampler(index<<3);
    return sample>>2;
}     
// 4 octave sawtooth sampler
int8_t audio_4octave_mix_sampler(uint16_t index)
{
    int16_t sample =   audio_sawtooth_sampler(index<<1)
                     + (audio_triangle_sampler(index<<0)<<1);
                     
    return sample>>1;
}       

// min 10ms
#define ADSR_RAMP_MS(ms) (256/((ms)/10))
#define ADSR_VOLUME(pct) (255*(pct)/100)

// ADSR parameters: attack delta, attack peak, decay delta, sustain value, release delta
AL_ADSR audio_adsr_on =     {256, 255, 0, 255, -255};
AL_ADSR audio_adsr_piano =  {256, 255, ADSR_RAMP_MS(050),255*.60,ADSR_RAMP_MS(900)};  
AL_ADSR audio_adsr_8bit =   {ADSR_RAMP_MS(50), 255, ADSR_RAMP_MS(300), 255*.66, ADSR_RAMP_MS(900)};  
AL_ADSR audio_adsr_violin = {ADSR_RAMP_MS(150),255, ADSR_RAMP_MS(300), 255*.76, ADSR_RAMP_MS(90)};  
AL_ADSR audio_adsr_flute =  {ADSR_RAMP_MS(350),255, ADSR_RAMP_MS(300), 255*.66, ADSR_RAMP_MS(90)};  
AL_ADSR audio_adsr_sax =    {ADSR_RAMP_MS(350),255, ADSR_RAMP_MS(300), 255*.66, ADSR_RAMP_MS(90)};  
AL_ADSR audio_adsr_tom =    {128, 255, ADSR_RAMP_MS(250) ,  0, 0};  
AL_ADSR audio_adsr_snare =  {128, 255, ADSR_RAMP_MS(3000),  0, 0};  
AL_ADSR audio_adsr_cymbol = {128, 255, ADSR_RAMP_MS(650) ,  0, 0};  
AL_ADSR audio_adsr_hihat =  {128, 255, ADSR_RAMP_MS(1000), 64, ADSR_RAMP_MS(150)};  
    
// Instrument: sampler, ADSR, vibrato amplitude, vibrato delta, tremolo amplitude, tremolo delta
AL_Instrument audio_instrument_sine =   { audio_sine_sampler,       &audio_adsr_on,         0,0,    0,0};
AL_Instrument audio_instrument_triangle={ audio_triangle_sampler,   &audio_adsr_on,         0,0,    0,0};
AL_Instrument audio_instrument_square = { audio_square_sampler,     &audio_adsr_on,         0,0,    0,0};
AL_Instrument audio_instrument_sawtooth={ audio_sawtooth_sampler,   &audio_adsr_on,         0,0,    0,0};
AL_Instrument audio_instrument_4octave_sine= { audio_4octave_sine_sampler,&audio_adsr_on,   0,0,    0,0};
AL_Instrument audio_instrument_4octave_sawtooth= { audio_4octave_mix_sampler,&audio_adsr_on,0,0,    0,0};

AL_Instrument audio_instrument_piano =  { audio_sine_sampler,       &audio_adsr_piano,      0,0,    0,0};
AL_Instrument audio_instrument_organ =  { audio_triangle_sampler,   &audio_adsr_piano,      0,0,    0,0};
AL_Instrument audio_instrument_fat_organ={ audio_4octave_mix_sampler,&audio_adsr_piano,   0,0,    0,0};
AL_Instrument audio_instrument_synth =  { audio_sawtooth_sampler,   &audio_adsr_piano,      0,0,    0,0};
AL_Instrument audio_instrument_8bit =   { audio_square_sampler,     &audio_adsr_8bit,       0,0,    0,0};
AL_Instrument audio_instrument_vibraphone={ audio_sine_sampler,     &audio_adsr_piano,      4<<4,1<<4,    2<<4,1<<4};

AL_Instrument audio_instrument_violin = { audio_sawtooth_sampler,   &audio_adsr_violin,     48,4,    32,4};
//AL_Instrument audio_instrument_violin = { audio_sawtooth_sampler,   &audio_adsr_violin,     4<<4,1<<4,    2<<4,1<<4};

AL_Instrument audio_instrument_drum =   { audio_noise2_sampler,     &audio_adsr_piano,      0,0,    0,0};
AL_Instrument audio_instrument_hihat =  { audio_noise2_sampler,     &audio_adsr_hihat,      5<<4,-1<<4,   0,0};
AL_Instrument audio_instrument_snare =  { audio_noise2_sampler,     &audio_adsr_tom,        1000<<4,-1,0,0};
AL_Instrument audio_instrument_cymbol = { audio_noise2_sampler,     &audio_adsr_cymbol,     50<<4,-5<<4,  0,0};
AL_Instrument audio_instrument_tom =    { audio_sine_sampler,       &audio_adsr_tom,        100<<4,-1<<4, 0,0};

