fr0sty1/ch32v003fun/examples/tim1_pwm/audio.c
AL_Instrument audio_instrument_flute =  { audio_triangle_sampler,   &audio_adsr_flute,      4<<4,1<<4,    2<<4,1<<4};
AL_Instrument audio_instrument_sax =    { audio_triangle_sampler,   &audio_adsr_sax,        4<<4,1<<4,    2<<4,1<<4};

// harpsicord

AL_Instrument audio_instrument_bubble ={ audio_sine_sampler,&audio_adsr_tom,-1,10,0,0};


/*
cymbol pitch=5019, 10003 10013, 16387 
5039 bass drum
snare  12036
snare  12080 (or 81)
*/



// multiply an 8 bit unsigned volume by an 8 bit signed sample 
// returning a signed modulated sample
int16_t audio_volume_sample_multiply(uint16_t u,int16_t s)
{
    uint16_t su = (s>=0) ? (uint16_t) s : -((uint16_t) s);
    uint16_t ret = 0;
	uint16_t multiplicand = su; //small_num;
	uint16_t mutliplicant = u;  //big_num;
	do
	{
		if( multiplicand & 1 )
			ret += mutliplicant;
		mutliplicant<<=1;
		multiplicand>>=1;
	} while( multiplicand );

	return ((s>=0) ? (int16_t) ret : -((int16_t) ret))>>8;
}

// multiply 8 bit unsigned volumes by one another, returning an 8 bit volume
uint16_t audio_volume_volume_multiply(uint16_t v1,uint16_t v2)
{
    uint16_t ret = 0;
	uint16_t multiplicand = v1; //small_num;
	uint16_t mutliplicant = v2;  //big_num;
	do
	{
		if( multiplicand & 1 )
			ret += mutliplicant;
		mutliplicant<<=1;
		multiplicand>>=1;
	} while( multiplicand );

	return ret>>8;
}

// initialize audio library
void audio_initialize( void )
{
    audio_system.volume=255;
    audio_system.envelopedivider=AUDIO_SHAPE_DIVIDER; 
    fifo_initialize(&audio_system.fifo);
    for (uint16_t channel=0;channel<AUDIO_CHANNELS; ++channel)
    {
        AL_Channel *pchannel=&audio_system.channel[channel];
        pchannel->volume=255;
        pchannel->compositevolume=(255*255>>8);

        for (uint16_t voice=0;voice<AUDIO_VOICES; ++voice)
        {
            AL_Voice *pvoice=&pchannel->voice[voice];
            pvoice->position=0;            
            pvoice->delta=0;            
            pvoice->pitchbend=0;            
            pvoice->volume=255;
            pvoice->compositevolume=(255*255*255>>16);
            pvoice->output_value=0;
            pvoice->instrument=NULL;
        }
    }    

#ifdef AUDIO_DEBUG
    printf("Audio initialize\n");
    printf("Audio system has %d channels, each with %d voices\n",AUDIO_CHANNELS,AUDIO_VOICES);
    printf("Audio sample update frequency is %d Hz (actual %d Hz)\n",AUDIO_UPDATE_FREQUENCY, AUDIO_ACTUAL_UPDATE_FREQUENCY);
    printf("Audio shape update frequency is %d Hz\n",AUDIO_UPDATE_FREQUENCY/AUDIO_SHAPE_DIVIDER);
    printf("Audio fifo size is %d (for all channels)\n",AUDIO_FIFO_SIZE);
    printf("sizeof(audio_system)=%d\n",sizeof(audio_system));
#endif
}

// Audio update
void audio_update( void )
{
    // master*channel*voice*velocity*adsr*sample
    // system
    // master*channel*voice => composite
    // keyon
    //      composite*velocity => notevolume
    //      ADSR scaled by notevolume
    // playback
    //      (adsr+tremolo)*sample

    // Process volumes if any have changed
    if ( audio_system.flags & AL_SYSTEM_FLAG_UPDATE_COMPOSITE_VOLUME)
    {
        for (uint16_t channel=0 ; channel < AUDIO_CHANNELS ; ++channel)
        {
            AL_Channel *pchannel=&audio_system.channel[channel];

            // Update composite channel volumes
            if ( (audio_system.flags & AL_SYSTEM_FLAG_UPDATE_VOLUME) | 
                (pchannel->flags & AL_SYSTEM_FLAG_UPDATE_VOLUME) )
            {         
                pchannel->compositevolume = audio_volume_volume_multiply(audio_system.volume,pchannel->volume);
                pchannel->flags |= AL_SYSTEM_FLAG_UPDATE_VOLUME;
            }

            // Update composite voice volumes
            for (uint16_t voice=0;voice<AUDIO_VOICES; ++voice)
            {
                AL_Voice *pvoice=&pchannel->voice[voice];

                if ( (pchannel->flags & AL_SYSTEM_FLAG_UPDATE_VOLUME) |
                    (pvoice->flags & AL_SYSTEM_FLAG_UPDATE_VOLUME) )
                {
                    pvoice->compositevolume = audio_volume_volume_multiply(pchannel->compositevolume,pvoice->volume);              
                    pvoice->flags &= ~AL_SYSTEM_FLAG_UPDATE_VOLUME;
                }
            }
            pchannel->flags&= ~AL_SYSTEM_FLAG_UPDATE_VOLUME;
        }
        audio_system.flags &= ~AL_SYSTEM_FLAG_UPDATE_VOLUME;
    }

    // update timers of all voice playback parameters
    for (uint16_t channel=0;channel<AUDIO_CHANNELS; ++channel)
    {
        AL_Channel *pchannel=&audio_system.channel[channel];
        pchannel->output_value=0;
        for (uint16_t voice=0;voice<AUDIO_VOICES; ++voice)
        {
            AL_Voice *pvoice=&pchannel->voice[voice];
            if (pvoice->playing)
            {
                if (pvoice->instrument!=NULL)
                {
                    // there is an instrument, process
                    pvoice->position += pvoice->delta + (pvoice->vibrato>>4) + pvoice->pitchbend;
                    int16_t sample = (int16_t) pvoice->instrument->sample(pvoice->position);
                    pvoice->output_value=audio_volume_sample_multiply(pvoice->sample_volume, sample);
                    //pvoice->output_value=128-pvoice->adsr_volume;
                    //printf("%d %d %d %d %d \n",voice,pvoice->position, sample, pvoice->output_value, pvoice->sample_volume);
                }
            }
            else
            {
                // voice not playing 
                // drift value to center 
                if (pvoice->output_value!=0)
                {
                    if (pvoice->output_value > 0)
                    {
                        --pvoice->output_value;
                    }
                    else
                    {
                        ++pvoice->output_value;
                    }  
                }
            }
            pchannel->output_value+=pvoice->output_value;
        }
        // If there is more than one voice then we need to prevent clipping
        #if AUDIO_VOICES_POW2
        pchannel->output_value>>=AUDIO_VOICES_POW2;//-1;
        #endif
    }

