fr0sty1/ch32v003fun/examples/tim1_pwm/audio.c
     // update audio shape
    // todo could process updates in phases 
        // one to composite volumes
        // one for each voice of each channel
        // one to commit values
     

    if (--audio_system.envelopedivider==0)
    {
        audio_system.envelopedivider=AUDIO_SHAPE_DIVIDER;    // 10ms
        // envelope update
        for (uint16_t channel=0;channel<AUDIO_CHANNELS; ++channel)
        {
            AL_Channel *pchannel=&audio_system.channel[channel];
            for (uint16_t voice=0;voice<AUDIO_VOICES; ++voice)
            {
                AL_Voice *pvoice=&pchannel->voice[voice];
                AL_ADSR *padsr=&pvoice->adsr_composite;
                switch (pvoice->adsr_phase)
                {
                    case 'a':
                        pvoice->adsr_volume += padsr->attack_delta;
                        if (pvoice->adsr_volume >= padsr->attack_peak)
                        {
                            pvoice->adsr_phase = 'd';
                            pvoice->adsr_volume = padsr->attack_peak;
                        }
                        //printf("attack %d\n",pvoice->adsr_volume);
                        break;
                    case 'd':
                        pvoice->adsr_volume -= padsr->decay_delta;
                        if ((pvoice->adsr_volume <= padsr->sustain_value) || (pvoice->adsr_volume <0))
                        {
                            pvoice->adsr_phase='s';
                            pvoice->adsr_volume=padsr->sustain_value;
                        }
                        //printf("decay %d\n",pvoice->adsr_volume);
                        break;
                    case 's':
                        // sustain does nothing but waits for a key release
                        //printf("sustain %d\n",pvoice->adsr_volume);
                        break;
                    case 'r':
                        pvoice->adsr_volume -= padsr->release_delta;
                        if (pvoice->adsr_volume < 0)
                        {
                            pvoice->adsr_phase='x';
                            pvoice->adsr_volume=0;
                            pvoice->playing=false;
                        }
                        //printf("release %d\n",pvoice->adsr_volume);
                        break;   
                    default:
                        // ADSR not active
                        //printf("none %d\n",pvoice->adsr_volume);
                        break;                     
                }

                pvoice->vibrato += pvoice->vibrato_delta;
                if (pvoice->vibrato > 0)
                {
                    if (pvoice->vibrato >= pvoice->instrument->vibrato_amplitude)
                    {
                        pvoice->vibrato_delta = -pvoice->vibrato_delta;
                        pvoice->vibrato = (pvoice->instrument->vibrato_amplitude<<1)-pvoice->vibrato;
                    }
                }   
                else if (pvoice->vibrato < 0)
                {
                    if ((-pvoice->vibrato) >= pvoice->instrument->vibrato_amplitude)
                    {
                        pvoice->vibrato_delta = -pvoice->vibrato_delta;
                        pvoice->vibrato = -(pvoice->instrument->vibrato_amplitude<<1)-pvoice->vibrato;
                    }
                }
               
                pvoice->tremolo += pvoice->tremolo_delta;
                if (pvoice->tremolo>0)
                {
                    if (pvoice->tremolo >= pvoice->tremolo_amplitude)
                    {
                        pvoice->tremolo_delta = -pvoice->tremolo_delta;
                        pvoice->tremolo = (pvoice->tremolo_amplitude << 1) - pvoice->tremolo;
                    }
                }   
                else if (pvoice->tremolo < 0)
                {
                    if (-pvoice->tremolo > pvoice->tremolo_amplitude)
                    {
                        pvoice->tremolo_delta = -pvoice->tremolo_delta;
                        pvoice->tremolo = -(pvoice->tremolo_amplitude<<1) - pvoice->tremolo;
                    }
                }
// todo tremolo is pushing volumes over 255
                // Calculate volume to be applied to the sampler
                // Note: Composite volume is applied to ADSR and tremolo parameters in keyon
                pvoice->sample_volume = pvoice->adsr_volume + (pvoice->tremolo>>4);
                //printf("adsr: %c %d\n",pvoice->adsr_phase,pvoice->adsr_volume);
            }
        }
    }
}

// Get the value of an output pin
unsigned char audio_get_channel_value(uint16_t channel)
{   
    int16_t value = audio_system.channel[channel].output_value+(AUDIO_TIMER_RELOAD/2);
    // clamp to PWM range (some headroom over the designed 0-255 based on playback frequency)
    if (value<0)  
    {
        value=0;
    }
    if (value>AUDIO_TIMER_RELOAD) 
    {
        value=AUDIO_TIMER_RELOAD;
    }

    return (unsigned char) value;
}

// Set audio system master volume
inline void audio_set_master_volume(uint16_t volume ) 
{
    // Volume changes are expensive and only should be done when needed (no hardware multiply)
    if (audio_system.volume != volume)
    {
        // Set the master volume
        audio_system.volume=volume;
        // Flag that composite volumes need to be updated next update and that the master volume has changed
        audio_system.flags |= AL_SYSTEM_FLAG_UPDATE_VOLUME | AL_SYSTEM_FLAG_UPDATE_COMPOSITE_VOLUME;
    }
}

// Set audio system channel volume
inline void audio_set_channel_volume(uint16_t channel,
                                     uint16_t volume )
{
    // Volume changes are expensive and only should be done when needed (no hardware multiply)
    if (audio_system.channel[channel].volume != volume)
    {
        // Set the channel volume
        audio_system.channel[channel].volume=volume;
        // Flag that the channel composite volume needs update
        audio_system.channel[channel].flags |= AL_SYSTEM_FLAG_UPDATE_VOLUME;
        // Flag that a volume has changed and composite volumes need to be updated next update
        audio_system.flags |= AL_SYSTEM_FLAG_UPDATE_COMPOSITE_VOLUME;
    }
}

