fr0sty1/ch32v003fun/examples/tim1_pwm/audio.c
// Set audio system voice volume
inline void audio_set_voice_volume( uint16_t channel,
                                    uint16_t voice,
                                    uint16_t volume )
{
    // Volume changes are expensive and only should be done when needed (no hardware multiply)
    if (audio_system.channel[channel].voice[voice].volume != volume)
    {
        // Set the voice volume
        audio_system.channel[channel].voice[voice].volume = volume;
        // Flag that the voice composite volume needs update
        audio_system.channel[channel].voice[voice].flags |= AL_SYSTEM_FLAG_UPDATE_VOLUME;
        // Flag that a volume has changed and composite volumes need to be updated next update
        audio_system.flags |= AL_SYSTEM_FLAG_UPDATE_COMPOSITE_VOLUME;
    }
}

// Key a note on a voice on
void audio_keyon(   uint16_t channel,
                    uint16_t voice,
                    uint16_t frequency,
                    uint16_t velocity )
{
    AL_Voice *pvoice = &audio_system.channel[channel].voice[voice];
    // frequency calculations
    // samplerstepspersecond=samplerstepspercycle*cyclespersecond
    uint32_t samplerstepspersecond= ((uint32_t) frequency)<<16;
    // stepsperupdate=stepspersecond/updatespersecond
    pvoice->delta=samplerstepspersecond/((uint32_t)AUDIO_UPDATE_FREQUENCY);
    pvoice->pitchbend=0;

    // todo use a volume multiply routine
    // todo use an early exit multiply

    //pvoice->position=0;       // commented out to maintain phase if interrupted playing channel
    //pvoice->output_value=0;   // commented out to prevent audible click

    AL_Instrument *pinstrument=pvoice->instrument;

    // Calculate overall voice volume (system*channel*voice*velocity)
    uint16_t compositevelocityvolume=(uint16_t) ((uint32_t) pvoice->compositevolume * (uint32_t) velocity)>>8;

    // todo, only update when velocity or adsr are different

    // Scale ADSR by voice velocity composite volume 
    AL_ADSR *padsr_instrument = pinstrument->adsr;
    AL_ADSR *padsr_voice=&pvoice->adsr_composite;
    padsr_voice->attack_delta  = (uint16_t) ((uint32_t) padsr_instrument->attack_delta * (uint32_t) compositevelocityvolume)>>8;
    padsr_voice->attack_peak   = (uint16_t) ((uint32_t) padsr_instrument->attack_peak * (uint32_t) compositevelocityvolume)>>8;
    padsr_voice->decay_delta   = (uint16_t) ((uint32_t) padsr_instrument->decay_delta * (uint32_t) compositevelocityvolume)>>8;
    padsr_voice->sustain_value = (uint16_t) ((uint32_t) padsr_instrument->sustain_value * (uint32_t) compositevelocityvolume)>>8;
    padsr_voice->release_delta = (uint16_t) ((uint32_t) padsr_instrument->release_delta * (uint32_t) compositevelocityvolume)>>8;
    // Start ADSR
    pvoice->adsr_phase='a';
    pvoice->adsr_volume=padsr_voice->attack_delta;

    // Start vibrato
    pvoice->vibrato = 
    pvoice->vibrato_delta = 
        pinstrument->vibrato_delta;

    // Scale tremolo by voice velocity composite volume and start tremolo
    pvoice->tremolo =
    pvoice->tremolo_delta =
        (uint16_t) ((uint32_t) pinstrument->tremolo_delta * (uint32_t) compositevelocityvolume)>>8;
    pvoice->tremolo_amplitude =        
        (uint16_t) ((uint32_t) pinstrument->tremolo_amplitude * (uint32_t) compositevelocityvolume)>>8;

    // Set the initial sample volume
    pvoice->sample_volume = pvoice->adsr_volume + pvoice->tremolo;

    // Start the voice playing
    pvoice->playing=true;
}

// Key a note on a voice off (trigger sound decay)
void audio_keyoff(   uint16_t channel,
                    uint16_t voice)
{
    AL_Voice *pvoice = &audio_system.channel[channel].voice[voice];
    if (pvoice->playing)
    {
        pvoice->adsr_phase='r';
    }
    //GPIOD->BSHR = (1<<4);	 	 // Turn on  D4 for debug profiling
    //GPIOD->BSHR = (1<<(16+4)); // Turn off D4 for debug profiling
}

// Stop and silence a voice
void audio_stopvoice(uint16_t channel,
                    uint16_t voice)
{
    // Stopping a voice immediately stops playing a sound
    // an audible click is likely
    audio_system.channel[channel].voice[voice].playing=false;
}

// shutdown audio library and release resources
void audio_release( void )
{
#ifdef AUDIO_DEBUG
    printf("Audio release\n");
    // Nothing to do since audio library is statically allocated 
    // and update will no longer be called
#endif
}

// Initialize FIFO
void fifo_initialize(AL_FIFO* fifo)
{
    fifo->index_head=0;
    fifo->index_tail=0;
    fifo->free=AUDIO_FIFO_SIZE;
}

// Read an element from the FIFO
uint8_t fifo_read(AL_FIFO* fifo)
{
    if (fifo->free == AUDIO_FIFO_SIZE)
    {
        // FIFO empty
        // return the last value in the fifo
        return fifo->audio_fifo[(fifo->index_tail-1)&((1<<AUDIO_FIFO_SIZE_POW2)-1)];
    }
    else
    {
        // Return current data and advance tail index
        uint8_t data=fifo->audio_fifo[fifo->index_tail++];
        
        // Wrap tail in buffer
        fifo->index_tail&=((1<<AUDIO_FIFO_SIZE_POW2)-1);
        
        // Track data read
        ++fifo->free;

        // Return data
        return data;
    }
}

// Write an element to the FIFO, return true if successful
uint8_t fifo_write(AL_FIFO* fifo,uint8_t data)
{
    // If the head passes the tail, one FIFO of data will be discarded
    if (fifo->free==0)
    {
        // FIFO full, fail write
        return false;
    }
    else
    {
        // Return current data and advance tail index
        fifo->audio_fifo[fifo->index_head++]=data;
        // Wrap tail in buffer
        fifo->index_head&=((1<<AUDIO_FIFO_SIZE_POW2)-1);
        // Track data written
        --fifo->free;
        // Return success
        return true;
    }
}

// Return the amount of data free in the FIFO
uint16_t fifo_free(AL_FIFO* fifo)
{
    return fifo->free;
}

// Return the amount of used in the FIFO
uint16_t fifo_used(AL_FIFO* fifo)
{
    return AUDIO_FIFO_SIZE-fifo->free;
}
